// import React from 'react'
// import './Embedded.css'
// import './styleall.css'
function Embedded() {
  return (
    <>
      <div className="content">
        <h1>Emdedded</h1>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ระบบฝังตัวหรือ สมองกลฝังตัว (embedded system) คือระบบประมวลผล ที่ใช้ชิปหรือไมโครโพรเซสเซอร์ที่ออกแบบมาโดยเฉพาะ เป็นระบบคอมพิวเตอร์ขนาดจิ๋วที่ฝังไว้ในอุปกรณ์ เครื่องใช้ไฟฟ้า และเครื่องเล่นอิเล็กทรอนิกส์ต่างๆ เพื่อเพิ่มความฉลาด ความสามารถให้กับอุปกรณ์เหล่านั้นผ่านซอฟต์แวร์ซึ่งต่างจากระบบประมวลผลที่เครื่องคอมพิวเตอร์ทั่วไป ระบบฝังตัวถูกนำมาใช้กันอย่างแพร่หลายในยานพาหนะ เครื่องใช้ไฟฟ้าในบ้านและสำนักงาน อุปกรณ์อิเล็กทรอนิกส์ เทคโนโลยีซอฟต์แวร์ เทคโนโลยีฮาร์ดแวร์ เทคโนโลยีเครือข่ายเน็ตเวิร์ก เทคโนโลยีด้านการสื่อสาร เทคโนโลยีเครื่องกลและของเล่นต่าง ๆ คำว่าระบบฝังตัวเกิดจาก การที่ระบบนี้เป็นระบบประมวลผลเช่นเดียวกับระบบคอมพิวเตอร์ แต่ว่าระบบนี้จะฝังตัวลงในอุปกรณ์อื่น ๆ ที่ไม่ใช่เครื่องคอมพิวเตอร์ ในปัจจุบันระบบสมองกลฝังตัวได้มีการพัฒนามากขึ้น โดยในระบบสมองกลฝังตัวอาจจะประกอบไปด้วยไมโครคอนโทรลเลอร์ หรือ ไมโครโปรเซสเซอร์ อุปกรณ์ที่ใช้ระบบสมองกลฝังตัวที่เห็นได้ชัดเช่นโทรศัพท์มือถือ และในระบบสมองกลฝังตัวยังมีการใส่ระบบปฏิบัติการต่างๆแตกต่างกันไปอีกด้วย ดังนั้น ระบบสมองกลฝังตัวอาจจะทำงานได้ตั้งแต่ควบคุมหลอดไฟจนไปถึงใช้ในยานอวกาศ</p>
        <div>
          <h2>ส่วนประกอบของ Embedded System</h2>
          <h3>&nbsp;&nbsp;&nbsp;Embedded System ประกอบด้วยส่วนประกอบหลักๆ ดังนี้:</h3>
          <ul className='ul'>
            <li><p>หน่วยประมวลผล (CPU): หน่วยหลักที่ทำการประมวลผลข้อมูล</p></li>
            <li><p>หน่วยความจำ (Memory): ใช้ในการเก็บข้อมูลและโปรแกรมที่ระบบต้องการ</p></li>
            <li><p>อุปกรณ์อินพุต/เอาต์พุต (I/O Devices): ใช้ในการรับข้อมูลจากภายนอกและส่งข้อมูลออกไป</p></li>
            <li><p>เฟิร์มแวร์ (Firmware): ซอฟต์แวร์ที่ถูกติดตั้งในฮาร์ดแวร์เพื่อควบคุมการทำงานของอุปกรณ์</p></li>
          </ul>
          <h2>ประเภทของ Embedded system</h2>
          <h3>&nbsp;&nbsp;&nbsp;bedded System สามารถแบ่งออกเป็นหลายประเภทตามการใช้งาน เช่น:</h3>
          <ul className="ul">
            <li><p>Standalone Embedded System: ทำงานแบบอิสระไม่ต้องพึ่งพาระบบอื่น</p></li>
            <li><p>Real-Time Embedded System: ทำงานในเวลาจริงที่ต้องการความแม่นยำสูง</p></li>
            <li><p>Network Embedded System: เชื่อมต่อกับระบบเครือข่ายเพื่อการสื่อสารข้อมูล</p></li>
            <li><p>Mobile Embedded System: ใช้งานในอุปกรณ์เคลื่อนที่ เช่น สมาร์ทโฟน</p></li>
          </ul>
        </div>

      </div>
    </>
    
  )
}

export default Embedded